app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("name", "email", "subject", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "aghjad"], ["email", "thienyglobe@gmail.com"], ["subject", "awas"], ["message", "asdad"], ["created_at", "2015-12-04 10:52:14.063998"], ["updated_at", "2015-12-04 10:52:14.063998"]]
---
  def create
    @contact = Contact.new(contact_params)
    ContactsMailer.contact_form_email(@contact).deliver_now

    respond_to do |format|
      if @contact.save